<a href="https://colab.research.google.com/github/TimTree/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-09-09 23:34:16--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.137.150
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.137.150|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’

instacart_online_gr 100%[===================>] 196.03M  43.4MB/s    in 5.1s

2019-09-09 23:34:21 (38.8 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

**We need the product_id and product_name to find out how many times the top 10 most frequently order products were ordered. We can grab the data from the products, order_products__prior, and order_products__train datasets.**

In [5]:
##### YOUR CODE HERE #####
import pandas as pd
products = pd.read_csv('products.csv')
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [6]:
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
order_products__train = pd.read_csv('order_products__train.csv')
order_products__train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [8]:
order_products__prior.shape

(32434489, 4)

In [9]:
order_products__train.shape

(1384617, 4)

In [0]:
order_products = pd.concat([order_products__prior, order_products__train])

In [0]:
assert order_products__prior.shape[0] + order_products__train.shape[0] == order_products.shape[0]

In [12]:
order_products.shape

(33819106, 4)

In [13]:
order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [14]:
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [15]:
order_products['product_id'].value_counts().head(10)

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

In [16]:
condition = (products['product_id'].isin(order_products['product_id'].value_counts().head(10).index.tolist()))
condition

0        False
1        False
2        False
3        False
4        False
5        False
6        False
7        False
8        False
9        False
10       False
11       False
12       False
13       False
14       False
15       False
16       False
17       False
18       False
19       False
20       False
21       False
22       False
23       False
24       False
25       False
26       False
27       False
28       False
29       False
         ...
49658    False
49659    False
49660    False
49661    False
49662    False
49663    False
49664    False
49665    False
49666    False
49667    False
49668    False
49669    False
49670    False
49671    False
49672    False
49673    False
49674    False
49675    False
49676    False
49677    False
49678    False
49679    False
49680    False
49681    False
49682    False
49683    False
49684    False
49685    False
49686    False
49687    False
Name: product_id, Length: 49688, dtype: bool

In [0]:
columns_needed = [
                  'product_id',
                  'product_name'
]

In [18]:
subset = products.loc[condition,columns_needed]
subset.head(10)

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana
26208       26209                   Limes
27844       27845      Organic Whole Milk
47208       47209    Organic Hass Avocado
47625       47626             Large Lemon
47765       47766         Organic Avocado

In [19]:
columns_order_products = ['product_id']
order_products = order_products[columns_order_products]
order_products.head()

   product_id
0       33120
1       28985
2        9327
3       45918
4       30035

In [20]:
merged = pd.merge(subset, order_products, how='inner', on='product_id')
merged

         product_id            product_name
0             13176  Bag of Organic Bananas
1             13176  Bag of Organic Bananas
2             13176  Bag of Organic Bananas
3             13176  Bag of Organic Bananas
4             13176  Bag of Organic Bananas
5             13176  Bag of Organic Bananas
6             13176  Bag of Organic Bananas
7             13176  Bag of Organic Bananas
8             13176  Bag of Organic Bananas
9             13176  Bag of Organic Bananas
10            13176  Bag of Organic Bananas
11            13176  Bag of Organic Bananas
12            13176  Bag of Organic Bananas
13            13176  Bag of Organic Bananas
14            13176  Bag of Organic Bananas
15            13176  Bag of Organic Bananas
16            13176  Bag of Organic Bananas
17            13176  Bag of Organic Bananas
18            13176  Bag of Organic Bananas
19            13176  Bag of Organic Bananas
20            13176  Bag of Organic Bananas
21            13176  Bag of Organic Bananas
22            13176  Bag of Organic Bananas
23            13176  Bag of Organic Bananas
24            13176  Bag of Organic Bananas
25            13176  Bag of Organic Bananas
26            13176  Bag of Organic Bananas
27            13176  Bag of Organic Bananas
28            13176  Bag of Organic Bananas
29            13176  Bag of Organic Bananas
...             ...                     ...
2418284       47766         Organic Avocado
2418285       47766         Organic Avocado
2418286       47766         Organic Avocado
2418287       47766         Organic Avocado
2418288       47766         Organic Avocado
2418289       47766         Organic Avocado
2418290       47766         Organic Avocado
2418291       47766         Organic Avocado
2418292       47766         Organic Avocado
2418293       47766         Organic Avocado
2418294       47766         Organic Avocado
2418295       47766         Organic Avocado
2418296       47766         Organic Avocado
2418297       47766         Organic Avocado
2418298       47766         Organic Avocado
2418299       47766         Organic Avocado
2418300       47766         Organic Avocado
2418301       47766         Organic Avocado
2418302       47766         Organic Avocado
2418303       47766         Organic Avocado
2418304       47766         Organic Avocado
2418305       47766         Organic Avocado
2418306       47766         Organic Avocado
2418307       47766         Organic Avocado
2418308       47766         Organic Avocado
2418309       47766         Organic Avocado
2418310       47766         Organic Avocado
2418311       47766         Organic Avocado
2418312       47766         Organic Avocado
2418313       47766         Organic Avocado

[2418314 rows x 2 columns]

In [21]:
merged['product_name'].value_counts().head(10)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
import numpy as np
table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [23]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

Tidy table1

In [24]:
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [25]:
tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [26]:
tidy = tidy.rename(columns={
    'index': 'name',
    'variable': 'trt',
    'value': 'result'
})
tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [27]:
tidy.trt = tidy.trt.str.replace('treatment','')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

Tidy table2

In [28]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [29]:
table2 = table2.T
table2

              treatmenta  treatmentb
John Smith           NaN         2.0
Jane Doe            16.0        11.0
Mary Johnson         3.0         1.0

In [30]:
table2 = table2.reset_index()
table2

          index  treatmenta  treatmentb
0    John Smith         NaN         2.0
1      Jane Doe        16.0        11.0
2  Mary Johnson         3.0         1.0

In [31]:
tidy2 = table2.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy2

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [32]:
tidy2 = tidy2.rename(columns={
    'index': 'name',
    'variable': 'trt',
    'value': 'result'
})
tidy2.trt = tidy2.trt.str.replace('treatment','')
tidy2

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

Tidy -> table1

In [33]:
wide = tidy.pivot_table(index='name',columns='trt',values='result')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

Tidy -> table2

In [34]:
table2

          index  treatmenta  treatmentb
0    John Smith         NaN         2.0
1      Jane Doe        16.0        11.0
2  Mary Johnson         3.0         1.0

In [35]:
wide2 = tidy2.pivot(index='trt',columns='name',values='result')
wide2

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [36]:
wide2 = wide2.rename_axis(None)
wide2 = wide2.rename_axis(None,axis=1)
wide2

   Jane Doe  John Smith  Mary Johnson
a      16.0         NaN           3.0
b      11.0         2.0           1.0

In [37]:
wide2 = wide2.rename(index={
    'a': 'treatmenta',
    'b': 'treatmentb'
})
wide2

            Jane Doe  John Smith  Mary Johnson
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [38]:
column_titles = ['John Smith','Jane Doe', 'Mary Johnson']
wide2 = wide2.reindex(columns=column_titles)
wide2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

Load seaborn's flights dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
import seaborn as sns
flights = sns.load_dataset('flights')

In [40]:
##### YOUR CODE HERE #####
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [41]:
flights2 = flights.pivot_table(index='year',columns='month',values='passengers')
flights2

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [42]:
##### YOUR CODE HERE #####

# I will interpret latest ordered popular products as those purchased
# at 23:00

orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [43]:
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [44]:
order_products = pd.concat([order_products__prior, order_products__train])
order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [45]:
productsFiltered = products.loc[:,'product_id':'product_name']
productsFiltered.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [46]:
order_productsFiltered = order_products.loc[:,['order_id','product_id']]
order_productsFiltered.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [47]:
ordersFiltered = orders.loc[:,['order_id','order_hour_of_day']]
ordersFiltered.head()

   order_id  order_hour_of_day
0   2539329                  8
1   2398795                  7
2    473747                 12
3   2254736                  7
4    431534                 15

In [0]:
merge1 = pd.merge(productsFiltered,order_productsFiltered)

In [49]:
merge2 = pd.merge(merge1,ordersFiltered)
merge2.head()

   product_id                product_name  order_id  order_hour_of_day
0           1  Chocolate Sandwich Cookies      1107                 11
1         769      Sliced American Cheese      1107                 11
2        6184                 Clementines      1107                 11
3        8048     Packaged Grape Tomatoes      1107                 11
4        9007              Frosted Flakes      1107                 11

In [50]:
merge2.shape

(33819106, 4)

In [51]:
merge2['order_hour_of_day'].value_counts()

10    2874905
11    2852701
14    2810918
15    2780731
13    2778054
12    2732599
16    2647695
9     2550569
17    2186409
8     1787359
18    1714445
19    1317576
20    1017958
7      928239
21     831183
22     662053
23     419585
6      302642
0      228031
1      121412
5       91909
2       72660
4       55714
3       53759
Name: order_hour_of_day, dtype: int64

In [0]:
merge2['is_hour_23'] = (merge2['order_hour_of_day'] == 23)

In [53]:
merge2.head()

   product_id                product_name  ...  order_hour_of_day  is_hour_23
0           1  Chocolate Sandwich Cookies  ...                 11       False
1         769      Sliced American Cheese  ...                 11       False
2        6184                 Clementines  ...                 11       False
3        8048     Packaged Grape Tomatoes  ...                 11       False
4        9007              Frosted Flakes  ...                 11       False

[5 rows x 5 columns]

In [54]:
merge3 = merge2[merge2['is_hour_23']==True]
merge3.head()

     product_id                product_name  ...  order_hour_of_day  is_hour_23
121           1  Chocolate Sandwich Cookies  ...                 23        True
838           1  Chocolate Sandwich Cookies  ...                 23        True
839       12341               Hass Avocados  ...                 23        True
840       13176      Bag of Organic Bananas  ...                 23        True
841       36051               Glass Cleaner  ...                 23        True

[5 rows x 5 columns]

In [55]:
merge3['product_name'].value_counts().head(25)

Banana                                  5587
Bag of Organic Bananas                  5098
Organic Strawberries                    3677
Organic Baby Spinach                    3304
Organic Hass Avocado                    2702
Organic Avocado                         2280
Strawberries                            1920
Large Lemon                             1906
Organic Raspberries                     1872
Organic Whole Milk                      1870
Limes                                   1823
Organic Blueberries                     1533
Organic Zucchini                        1508
Organic Garlic                          1463
Organic Yellow Onion                    1394
Cucumber Kirby                          1250
Organic Lemon                           1191
Organic Cucumber                        1180
Organic Grape Tomatoes                  1165
Seedless Red Grapes                     1137
Organic Baby Carrots                    1103
Organic Cilantro                        1074
Organic Large Extra Fancy Fuji Apple    1045
Carrots                                 1037
Apple Honeycrisp Organic                1015
Name: product_name, dtype: int64

No ice cream here. Probably interpreted the question incorrectly.

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####